{"Schnauzer": null, "Jack Russell Terrier": "There&#039;s nothing quite like puppy sweetness and silliness...and then they put their beautiful heads quietly on your shoulder breathing their...", "Labrador Retriever": "Please meet Jethro! Hailing from Houston, Texas, this big boy weighs in at an approximate 75lbs; he is neutered, up-to-date...", "Border Collie": "Hi! I am Baba. I am a sweet boy with a great history with kids. I get excited when I...", "Chihuahua": "0421013\n\nI&amp;#39;m heartworm positive. Heartworm is NOT contagious. The rescue covers the cost of treatment at the rescue&amp;#39;s vet. \n\nThis...", "Catahoula Leopard Dog": "He is your chill and relaxed companion. He is easy to leash and would love to walk around and check...", "German Shepherd Dog": "Opal is a beautiful young shepherd looking for an adopter experienced with her breed, and ready to help train her...", "Australian Shepherd": null, "Havanese": "Click here to learn more about my Behavior Level We elected to fast track this dog to adoptions. Therefore no...", "Pit Bull Terrier": "Hercules is a sweet, but high energy guy, and has been known to jump and mouth when too excited. He...", "West Highland White Terrier / Westie": "AMAZING LOYAL CUTIE PIE! Favorite Things: Treats, toys, walks, pets, outdoor playtime! Special Features: Easy to leash and walks well...", "Boxer": "Look at that smirk! Daisy is a sweet, quirky girl with a fun personality! She is very energetic and is...", "Husky": null, "Staffordshire Bull Terrier": "She is a high energy dog that would love an active home. She is very playful and loves to play...", "Dachshund": "Maria is an easygoing former mom in our rescue. She is believed to be approximately two years old. Her breed...", "Dutch Shepherd": null, "Retriever": "1020072\n\nHi, My name is Calvin.\n\nI am a happy go lucky young man. I love to play with anyone...", "Cattle Dog": "Pop Rocks is a little girl, parvo surviver. Date of birth March 9th 2021. This baby is spayed, chipped, bordetella...", "Leonberger": "He is a nice and playful guy. He is easy to leash up and walk to explore the neighborhood. He...", "Siberian Husky": "Pan is your typical goofy and independent husky-type breed, that would rather adventure than cuddle. He bonds with his person,...", "Australian Kelpie": "Kwali is an active lady, who is still learning how best to interact with the world. She&amp;#39;s very sweet when...", "Rottweiler": "Gunner is such a handsome, sweet boy, just look at the love in his eyes! He loves to be petted...", "Great Dane": null, "Australian Cattle Dog / Blue Heeler": "He has a lot of puppy energy and puppy love to share with you family. This guy is very friendly...", "Terrier": "DAPPER GENTLEMAN!! Favorite Things: Ear scratches and rubs, walks/runs and hanging with his humans. Special Features: Check out my cool...", "Cane Corso": "Paws is a sweet and active pup, who needs some work with his continued socialization and manners. He can get...", "English Pointer": "Luna is a very sweet girl, who has some fear and submissive behavior. She shows some reactivity on leash towards...", "Great Pyrenees": "Casper is a sweet and gentle giant. He was brought to us because he needed more space than his previous...", "Doberman Pinscher": "Mac is an energetic guy with a fun personality! He can be shy at first and needs extra time to...", "Poodle": null, "Jindo": "Zoey is a friendly girl waiting for her chance to have a family of her own.  She is good around...", "Plott Hound": "Tessa is a sweet young girl full of life! She may not be a good fit for a home with...", "Pug": null, "Norfolk Terrier": "0521041\n\nI need a single family home with a fenced in yard!\n\nI&amp;#39;m heartworm positive. Heartworm is NOT contagious. The...", "Beagle": "0421062\n\nI need a single family home with a fenced in yard since I require lots of physical and mental..."}